tutorials/turbine/RefTurbine_001/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 126.0;

vertices        
(
    ( -3.0   -3.0   -3.0)
    ( 21.0   -3.0   -3.0)
    ( 21.0    3.0   -3.0)
    ( -3.0    3.0   -3.0)
    ( -3.0   -3.0    3.0)
    ( 21.0   -3.0    3.0)
    ( 21.0    3.0    3.0)
    ( -3.0    3.0    3.0)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (96 24 24) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    bottom 
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    top 
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    west
    { 
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    east
    { 
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    north
    { 
        type cyclic;
        neighbourPatch south;
        faces
        (
            (3 7 6 2)
        );
    }
    south
    { 
        type cyclic;
        neighbourPatch north;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
