tutorials/turbine/RefTurbine_001/system/turbineArrayProperties.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

globalProperties
{
    outputControl       "timeStep";
    outputInterval       1;
}

turbine0
{
    turbineType         "NREL5MWRef";
    baseLocation        (5.0191 0.0 -90.0);
    numBladePoints      64;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              10;
    tipRootLossCorrType "none";
    rotationDir         "cw";
    Azimuth              284.039683813;
    RotSpeed            9.10661850047;
    Pitch                0.0;
    TorqueGen            19956.3047967;
    NacYaw              270.0;
    fluidDensity        1.00;
}
